# RepeaterCoordinates Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RepeaterCoordinates Constructor
RepeaterCoordinates Class See Also
---
Creates zero dimensional coordinates.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public RepeaterCoordinates()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
RepeaterCoordinates()
```

# See Also
RepeaterCoordinates Class
RepeaterCoordinates Overload
Autodesk.Revit.DB Namespace